#### Terraform Plan 📖 (apply) env/dev/api_test_ecs_v1 `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.terraform_remote_state.vpc: Reading...[0m[0m
[0m[1mdata.terraform_remote_state.ecr: Reading...[0m[0m
[0m[1mdata.terraform_remote_state.ecr: Read complete after 2s[0m
[0m[1mdata.terraform_remote_state.vpc: Read complete after 2s[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.ecs_has_public_ip.aws_ecs_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "main" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m name     = "n-tech-go-echo-api-cluster"
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Env"       = "dev"
          [32m+[0m[0m "ManagedBy" = "Terraform"
          [32m+[0m[0m "Project"   = "create ecs v1"
        }
    }

[1m  # module.ecs_has_public_ip.aws_ecs_service.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "main" {
      [32m+[0m[0m cluster                            = (known after apply)
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 100
      [32m+[0m[0m desired_count                      = 1
      [32m+[0m[0m enable_ecs_managed_tags            = true
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m health_check_grace_period_seconds  = 0
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = "n-tech-go-echo-api-service"
      [32m+[0m[0m platform_version                   = "LATEST"
      [32m+[0m[0m propagate_tags                     = "NONE"
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Env"       = "dev"
          [32m+[0m[0m "ManagedBy" = "Terraform"
          [32m+[0m[0m "Project"   = "create ecs v1"
        }
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m deployment_circuit_breaker {
          [32m+[0m[0m enable   = true
          [32m+[0m[0m rollback = true
        }

      [32m+[0m[0m deployment_controller {
          [32m+[0m[0m type = "ECS"
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = true
          [32m+[0m[0m security_groups  = (known after apply)
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-09f662d0f8054199c",
            ]
        }
    }

[1m  # module.ecs_has_public_ip.aws_ecs_task_definition.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "main" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = jsonencode(
            [
              [32m+[0m[0m {
                  [32m+[0m[0m cpu               = 256
                  [32m+[0m[0m essential         = true
                  [32m+[0m[0m image             = "381491840465.dkr.ecr.ap-northeast-1.amazonaws.com/n-tech-go-echo:latest"
                  [32m+[0m[0m logConfiguration  = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-create-group  = "true"
                          [32m+[0m[0m awslogs-group         = "/ecs/n-tech-go-echo-api-task-family"
                          [32m+[0m[0m awslogs-region        = "ap-northeast-1"
                          [32m+[0m[0m awslogs-stream-prefix = "ecs"
                        }
                    }
                  [32m+[0m[0m memory            = 512
                  [32m+[0m[0m memoryReservation = 512
                  [32m+[0m[0m name              = "n-tech-go-echo-api-container"
                  [32m+[0m[0m portMappings      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPort = 8080
                          [32m+[0m[0m hostPort      = 8080
                          [32m+[0m[0m protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      [32m+[0m[0m cpu                      = "256"
      [32m+[0m[0m execution_role_arn       = (known after apply)
      [32m+[0m[0m family                   = "n-tech-go-echo-api-task-family"
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "512"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags_all                 = {
          [32m+[0m[0m "Env"       = "dev"
          [32m+[0m[0m "ManagedBy" = "Terraform"
          [32m+[0m[0m "Project"   = "create ecs v1"
        }
      [32m+[0m[0m track_latest             = false

      [32m+[0m[0m runtime_platform {
          [32m+[0m[0m cpu_architecture        = "X86_64"
          [32m+[0m[0m operating_system_family = "LINUX"
        }
    }

[1m  # module.ecs_has_public_ip.aws_iam_role.ecs_task_execution_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ecs_task_execution_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "n-tech-go-echo-api-cluster-task-execution-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Env"       = "dev"
          [32m+[0m[0m "ManagedBy" = "Terraform"
          [32m+[0m[0m "Project"   = "create ecs v1"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ecs_has_public_ip.aws_iam_role_policy_attachment.ecs_task_execution_role_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      [32m+[0m[0m role       = "n-tech-go-echo-api-cluster-task-execution-role"
    }

[1m  # module.ecs_has_public_ip.aws_security_group.main[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "main" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Allow inbound traffic to ECS tasks"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m from_port        = 8080
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 8080
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
      [32m+[0m[0m name                   = "n-tech-go-echo-api-cluster-ecs-tasks-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Env"       = "dev"
          [32m+[0m[0m "ManagedBy" = "Terraform"
          [32m+[0m[0m "Project"   = "create ecs v1"
        }
      [32m+[0m[0m vpc_id                 = "vpc-02f67dc7b7df29ff0"
    }

[1mPlan:[0m 6 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @NishimuraTakuya-nt, Action: `pull_request`*